#掌握5大金刚之string,和9字口诀：基建-增删改查操-切复
#5大金刚包括:list,tuple,str,set/frozenset,dict

#======================================================================
#A. 基础：不能重复，不分先后，不收容可变的东西
name = {'zs','lisi','zs'}
print(name)

#什么情况下用set

#======================================================================
#B. 建 大括号，空的代表dict，用set()可以转化iterable的对象
score = set()
score = {98,89,69,96}
score = set([7,8,8,9])


#======================================================================
#C. 增
score.add('zs')
print(score)

#======================================================================
#D. 删
score.remove('zs')
print(score)

score.discard('lisi') #有就移除，没有就什么也不报错
print(score)

score.clear() #清楚所有内容
print(score)

#======================================================================
#E. 改 - 没有顺序

#======================================================================
#F. 查 in, not in 成员运算符
score = {98,89,69,96}
print(98 in score)

#取一个东西
print(score.pop())

#======================================================================
#G. 操作：set集合 - 并，交
s1 = {1,2,3,4,5}
s2 = {4,5,6,7,8}

#并集
s3 = s1 | s2
s3 = s1.union(s2)
print(s3)

#交集
s3 = s1 & s2
s3 = s1.intersection(s2)
print(s3)

#差集
s3 = s1 - s2
print(s3)

#取不重复的并集
s3 = s1 ^ s2
print(s3)

#判断两个集合大小
print(s1.issuperset(s2))
print(s1 > s2)

#======================================================================
#H. 切 - 不存在

#======================================================================
#I. 复
print(score)
s4 = score.copy()
print(s4)

#======================================================================
#额外. frozenset
s5 = frozenset(s4)
print(s5)
s5.add(88) #AttributeError: 'frozenset' object has no attribute 'add'
